## TPC2 tarefa 2 - Python

In [13]:
import csv
import numpy as np
import pandas as pd
pd.set_option('display.min_rows', 20)
import matplotlib.pyplot as plt
%matplotlib inline

In [14]:
# For compatibility across multiple platforms
import os
IB = os.environ.get('INSTABASE_URI',None) is not None
open = ib.open if IB else open

### <font color = 'green'>World Cup with Pandas</font>
Solve the problems using the data in Pandas dataframes.

In [34]:
# Read the Players and Teams data into dataframes
f = open('Players.csv')
playersDF = pd.read_csv(f)
f = open('Teams.csv')
teamsDF = pd.read_csv(f)

In [36]:
#Qual jogador (print do ultimo nome) de uma equipa com "ia" no nome, 
#que jogou menos de 200 minutos e fez mais de 100 passes?

# Verificar que equipas contêm "ia" no nome.
Name = playersDF[playersDF.team.str.contains('ia')]
# Verificar que jogadores de uma equipa que contêm "ia" no nome, jogaram menos de 200 minutos.
Name = Name[Name.minutes<200]
# Verificar que jogadores de uma equipa que contêm "ia" no nome e jogaram menos de 200 minutos, fizeram mais de 100 passes.
Name = Name[Name.passes>100]
# Imprimir apenas o nome do jogador.
print(Name.iloc[0]['surname'])

Kuzmanovic

In [45]:
# Qual é o número médio de passes feitos pelos avançados? Pelos meio-campistas?
# Verifique se a resposta especifica qual é qual e não inclua outras
# posições no seu resultado.

# Agrupar os jogadores pela sua posição em campo.
MPasses = playersDF.groupby('position')
# Criar a função da média dos passos.
Mean = MPasses['passes'].mean()
# Aplicar e imprimir a média dos passos, dependendo da posição do jogador.
print('Avançados: {ava} - Meio-campistas: {mid}'.format(ava=Mean.loc['forward'],mid=Mean.loc['midfielder']))

Avançados: 50.82517482517483 - Meio-campistas: 95.2719298245614

In [93]:
# Qual equipe tem a maior relação (razão, racio, etc) de goalsFor versus goalsAgainst?
# Imprima apenas o nome da equipa.
# Dica: adicione uma coluna "racio" ao dataframe das equipas e, depois, faça o seu "sort" e, 
# em seguida, use a head(1) ou tail(1) ...

# Criar a fórmula para a relação de goalsFor versus goalsAgainst.
teamsDF['racio']= teamsDF['goalsFor']/teamsDF['goalsAgainst']
# Organizar os valores do mais alto para o mais baixo.
teamsDF.sort_values(by='racio', ascending=False)
# Selecionar o primeiro valor, já que é o mais alto.
strmaior=teamsDF['team'].iloc[0]
# Imprimir o nome da equipa com o valor mais alto.
print(strmaior)

Brazil

In [114]:
# Quantos jogadores que jogam numa equipa com ranking <10, 
# jogaram mais de 350 minutos?
# Lembrete: len() fornece o número de linhas que um dataframe contém

# Filtrar as diferentes equipas, selecionando as que têm um ranking inferior a 10.
Team = teamsDF[teamsDF.ranking<10]
#Criar uma lista para essas equipas.
Teamlist = Team['team'].tolist()
# Listar os jogadores pertencentes a cada equipa.
Player = playersDF[playersDF.team.isin(Teamlist)]
#Filtrar os jogadores, selecionando os que jogaram mais de 350 minutos.
Player = Player[Player.minutes>350]
# Imprimir o número de jogadores requerido.
len(Player)

54

### <font color = 'green'>Titanic with Pandas</font>
Solve the problems using the data in Pandas dataframe.

In [85]:
# Read the Titanic data into a dataframe
f = open('Titanic.csv')
titanicDF = pd.read_csv(f)
titanicDF

,last,first,gender,age,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22.0,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes
2,Heikkinen,Miss Laina,F,26.0,3,7.9250,Southampton,yes
3,Futrelle,Mrs. Jacques Heath (Lily May Peel),F,35.0,1,53.1000,Southampton,yes
4,Allen,Mr. William Henry,M,35.0,3,8.0500,Southampton,no
5,Moran,Mr. James,M,NaN,3,8.4583,Queenstown,no
6,McCarthy,Mr. Timothy J,M,54.0,1,51.8625,Southampton,no
7,Palsson,Master Gosta Leonard,M,2.0,3,21.0750,Southampton,no
8,Johnson,Mrs. Oscar W (Elisabeth Vilhelmina Berg),F,27.0,3,11.1333,Southampton,yes
9,Nasser,Mrs. Nicholas (Adele Achem),F,14.0,2,30.0708,Cherbourg,yes
...,...,...,...,...,...,...,...,...
881,Markun,Mr. Johann,M,33.0,3,7.8958,Southampton,no
882,Dahlberg,Miss Gerda Ulrika,F,22.0,3,10.5167,Southampton,no
883,Banfield,Mr. Frederick James,M,28.0,2,10.5000,Southampton,no
884,Sutehall,Mr. Henry Jr,M,25.0,3,7.0500,Southampton,no
885,Rice,Mrs. William (Margaret Norton),F,39.0,3,29.1250,Queenstown,no
886,Montvila,Rev. Juozas,M,27.0,2,13.0000,Southampton,no
887,Graham,Miss Margaret Edith,F,19.0,1,30.0000,Southampton,yes
888,Johnston,"Miss Catherine Helen ""Carrie""",F,NaN,3,23.4500,Southampton,no
889,Behr,Mr. Karl Howell,M,26.0,1,30.0000,Cherbourg,yes
890,Dooley,Mr. Patrick,M,32.0,3,7.7500,Queenstown,no

In [174]:
# Quantas mulheres casadas embarcaram em Cherbourg?
# Nota: 'first' é uma função no Pandas, então 'titanic.first' irá gerar um erro;
# use 'titanic[' first ']

# Filtrar os passageiros, selecionando os que contêm no seu nome "Mrs." (mulheres casadas).
Mrs = titanicDF[titanicDF['first'].str.contains('Mrs.')]
# Filtrar as mulheres casadas, selecionando as que embarcaram em Cherbourg.
Cherbourg = Mrs[Mrs.embarked.str.contains('Cherbourg')]
# Imprimir o números requeridos. 
print(len(Cherbourg))

33

In [175]:
# Liste a tarifa média paga pelos passageiros em cada uma das cidades de embarque.

# Agrupar os passageiros pela àrea onde embarcaram.
Mtarifa = titanicDF.groupby('embarked')
# Criar a fórmula da média para as tarifas.
Mean = Mtarifa['fare'].mean()
# Calcular e imprimir a média das tarifas por cidade de embarque.
print('Southampton: {sou} - Cherbourg: {che} - Queenstown: {que}'.format(sou=Mean.loc['Southampton'],che=Mean.loc['Cherbourg'], que=Mean.loc['Queenstown']))

Southampton: 27.243651393188795 - Cherbourg: 59.95414404761905 - Queenstown: 13.276029870129872

In [190]:
# Os valores inexistentes (missing)  no Pandas são nulos (null), impressos como 'NaN' e
# a function pd.isnull(v) verifica se um valor é nulo.
# Que fração dos passageiros não tem valor para a idade?

# Aplicar a função pd.insull() para verificar os valores nulos.
age_missing = pd.isnull(titanicDF["age"])
# Calcular a relação entre os passageiros com idade nula, e o número total de passageiros.
Racio = len(titanicDF[age_missing])/len(titanicDF.age)
# Imprimir o resultado.
print(Racio)

0.19865319865319866